app/controllers/api/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @event = Event.find_by(id: params[:id])