app/controllers/api/users_controller.rb

  def verify
    @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "JanetSnakehole"], ["LIMIT", 1]]

  def create
    # @user = User.find_by(email: params[:user][:email])
    # if @user
    #   return render json: @user
    # end

    @user = User.new(
      email: user_params[:email],
      password: user_params[:password]
    )

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "organizer_title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"