app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "tkCG9WyjwfEAs_A9W-JUjA"], ["LIMIT", 1]]
---
    def current_user
        @current_user = User.find_by(session_token: session.session_token)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-0WCBzDT3pPfXsMhAYW83g"], ["updated_at", "2019-07-05 22:34:04.229359"], ["id", 4]]
---
    def logout!
        session.session_token = nil
        user.session_token = User.generate_session_token
        user.save!