app/controllers/users_controller.rb

  def create
    @user = User.new(
      email: user_params[:email],
      password: user_params[:password]
    )

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"